hackffm/ESP32S3_OLED_Eyes/lib/hackffm_badge_lib/hackffm_badge_lib.cpp
  esp_wifi_set_max_tx_power(28); // 7 dbm
  
  esp_wifi_set_protocol(WIFI_IF_STA, WIFI_PROTOCOL_11B|WIFI_PROTOCOL_11G|WIFI_PROTOCOL_11N /* |WIFI_PROTOCOL_LR */);
  esp_wifi_config_espnow_rate(WIFI_IF_STA,  wifi_rate);

  txCommand("c");
  findDoorState = 1;
  findDoorTimeout = 0;

  return false;

}

void HackFFMBadgeLib::tryOpenDoor() {
  if(findDoorState == 2) {
    txCommand("O"); findDoorState++;
    findDoorTimeout = 0;
  }
}

void HackFFMBadgeLib::tryCloseDoor() {
  if(findDoorState == 2) {
    txCommand("C"); findDoorState++;
    findDoorTimeout = 0;
  }
}

void HackFFMBadgeLib::begin() {
  // Face must be created early, maybe some memory initialization issues there in... (weird eyes come out)
  if(face_) delete face_;
  face_ = new Face(/* screenWidth = */ 128, /* screenHeight = */ 64, /* eyeSize = */ 40);

  // a little less sound at boot
  pinMode(5, OUTPUT); digitalWrite(5, LOW); 
  pinMode(6, OUTPUT); digitalWrite(6, LOW);
  pinMode(7, OUTPUT); digitalWrite(7, LOW);
  
  // Power on OLED
  // Conserve power (to allow CR123 battery operation)
  WiFi.mode(WIFI_OFF);
  delay(1);

  // Activate Serial but wait no longer than 1s to be ready
  Serial.begin(115200); // Baudrate does not matter as it is done via USB CDC...
  elapsedMillis serialUpTimeout = 0;
  while (!Serial && serialUpTimeout < 1000) {
    delay(1);
  }
  LL_Log.begin(115200, 2222); // Serial baud (not used), TCP Port

  // Perform hardware detection
  detectHardware();

  // Initialize filesystem
  if(!LittleFS.begin()) {
    Serial.println("filesystem Mount Failed");
    return;
  }
  listDir("/", 0);
  
  // try to load user name from file
  String loadUserName = readFile("/name.txt");
  if(loadUserName.length() > 0) strlcpy(userName, loadUserName.c_str(), sizeof(userName)-1);
  
  // try to load host name from file
  uint8_t baseMac[6];
  esp_efuse_mac_get_default(baseMac);
  Serial.printf(" Base MAC: %02X:%02X:%02X:%02X:%02X:%02X\r\n", 
    (unsigned int)baseMac[0], (unsigned int)baseMac[1], 
    (unsigned int)baseMac[2], (unsigned int)baseMac[3], 
    (unsigned int)baseMac[4], (unsigned int)baseMac[5]);
  delay(10);
  String loadHostName = readFile("/hostname.txt");
  if(loadHostName.length() > 0) strlcpy(hostName, loadHostName.c_str(), sizeof(hostName)-1);
  else {
    // Generate a random name
    sprintf(hostName, "hackffm-badge-%02X%02X%02X", (unsigned int)baseMac[3], (unsigned int)baseMac[4], (unsigned int)baseMac[5]);
  }
  Serial.printf(" HostName: %s\r\n", hostName);

  // Try to load key from file
  if(loadKey() == false) {
    Serial.println(" loadKey failed - autogenerate new key");
    genKey();
    saveKey();
  } 
  
  char buf[70];
  bytes2hex(door_prikey, 32, buf);
  Serial.printf(" Door Private key: %s\r\n", buf);
  bytes2hex(door_pubkey, 32, buf);
  Serial.printf(" Door Public key:  %s\r\n", buf);
  Serial.printf(" Door Name: %s\r\n", door_name);

  // Start face and set some default values
  //if(face_) delete face_;
  //face_ = new Face(/* screenWidth = */ 128, /* screenHeight = */ 64, /* eyeSize = */ 40);
  faceActive = true;
  face().Behavior.GoToEmotion(eEmotions::Normal);
  face().Behavior.SetEmotion(eEmotions::Normal, 0.8);
  face().Behavior.SetEmotion(eEmotions::Glee, 0.05);
  face().Behavior.SetEmotion(eEmotions::Worried, 0.05);
  face().Behavior.SetEmotion(eEmotions::Surprised, 0.05);
  face().Behavior.SetEmotion(eEmotions::Skeptic, 0.05);
  // Automatically switch between behaviours (selecting new behaviour randomly based on the weight assigned to each emotion)
  face().RandomBehavior = true;
  face().Behavior.Timer.SetIntervalMillis(6000); // 6s

  face().RandomBlink = true; // Automatically blink
  face().Blink.Timer.SetIntervalMillis(4000);

  // Automatically choose a new random direction to look
  //face().RandomLook = true;  


  delay(3000);
  Serial.println("HackFFM Badge initialized");
}

// Touch sensor update, ArduinoOTA and Face update
void HackFFMBadgeLib::update() {
  if(lastTouchRead > 100) {
    lastTouchRead = 0;
    for(int i = 0; i < NUM_TOUCH_PINS; i++) {
      touch[i].update();
    }
    lastTouchLU = (float)touch[0].getTouchValue() / 50.0;
    lastTouchLD = (float)touch[1].getTouchValue() / 50.0;
    lastTouchRU = (float)touch[2].getTouchValue() / 50.0;
    lastTouchRD = (float)touch[3].getTouchValue() / 50.0;
    lastTouchX = (-lastTouchLU) + (-lastTouchLD) + (lastTouchRU) + (lastTouchRD);
    lastTouchY = (-lastTouchLU) + (-lastTouchRU) + (lastTouchLD) + (lastTouchRD);
    touchUpdated = true;
  }

  // Update face without drawing
  if((faceActive) && (face_)) {
    face_->Update(true);
  }

  ArduinoOTA.handle();
  if(OTAinProgress == true) {
    for(int i=0; i<20; i++) {
      delay(10);
      ArduinoOTA.handle();
    }
  } 

  if(findDoorState > 0) {
    if(findDoorTimeout > 4000) {
      findDoorState = 0;
      esp_now_deinit();
      WiFi.mode(WIFI_OFF);
      Serial.println("Find door timeout");
    } else {
      if(findDoorState < 10) {
        if(espNowRxDataLen > 0) {
          Serial.printf("RxLen: %d\r\n", espNowRxDataLen);
          // Check if it is valid Door protocol
          if(espNowRxDataLen >= (4+32+8+1)) {
            if(((espNowRxData[0] == 'D') && (espNowRxData[1] == '0') && (espNowRxData[2] == '0') && (espNowRxData[3] == 'a'))) {
              if(memcmp(&espNowRxData[4], door_pubkey, 32) == 0) {
                char cmd = espNowRxData[44];
                memcpy(lastChallenge, &espNowRxData[36], 8);
        
                switch (findDoorState)
                {
                  case 1: // challenge requested, expect now 'c'
                    if(cmd == 'c') findDoorState++; else findDoorState = 100;
                    //txCommand("t");
                    break;
        
                  case 3: // trigger requested, expect now 't'
                    if(cmd == 't') findDoorState++; else findDoorState = 100;
                    break;
                  
                  default:
                    break;
                }
                Serial.printf("RxCmd: %.*s\n", espNowRxDataLen-44, &espNowRxData[44]);
              }  
            }
          }
          
          espNowRxDataLen = 0;
        }
      }
    }
  }
    
