hackffm/ESP32S3_OLED_Eyes/lib/hackffm_badge_lib/hackffm_badge_lib.cpp
        }
      } else {
        if(c=='$') {
          dsFlags |= 1;
        } else {
          buf[idx++] = c;
        }        
      }
    } else {
      LINEFEED:
      switch(c) {
        case 0:
        case '\n':
          buf[idx] = 0;
          sw = u8g2.getUTF8Width(buf);
          if(dsFlags & 2) {
            // centered (plus offsetted by x)
            newX = (w - sw)/2 + x;
          } else if(dsFlags & 4) {
            // right (minus offsetted by x)
            newX = (w - sw) - x;
          } else {
            newX = x;
          }
          y += u8g2.getAscent()-u8g2.getDescent()+dy;
          u8g2.drawUTF8(newX,y,buf);
          idx = 0;
          break; 
      }
    }
  } while(c);

  if(!noDraw) u8g2.sendBuffer();

}

void HackFFMBadgeLib::initOLED() {
  // Unlike almost every other Arduino library (and the I2C address scanner script etc.)
  // u8g2 uses 8-bit I2C address, so we shift the 7-bit address left by one
  u8g2.setI2CAddress(OledAddress<<1);
  u8g2.begin();
  u8g2.enableUTF8Print();

  // make it faster
  u8g2.setBusClock(1000000UL);

  // dim display down 
  //u8g2.sendF("ca", 0xdb, 0); // not for SH1106 - need af (e3) afterwards
  //u8g2.sendF("ca", 0xd9, 0x2f);
  //u8g2.sendF("ca", 0xaf); // reactivate if display turns off (SH1106 need it)
  //u8g2.setContrast(0x32); // u8g2.sendF("ca", 0x81, 32);
  String BootMsg = "$!$c$6HackFFM Badge V1\n";
  BootMsg += String(__DATE__) + "\n" + String(__TIME__);

  drawString(BootMsg.c_str());

  u8g2log.begin(U8LOG_WIDTH, U8LOG_HEIGHT, u8log_buffer);	// assign only buffer, update full manual
  u8g2log.print("u8g2log:\r\n");
}

void HackFFMBadgeLib::detectHardware() {
  pinVariantIndex = 0; OledAddress = 0;
  if(freenoveBoardLED) { delete freenoveBoardLED; freenoveBoardLED = nullptr; }
  if(freenoveAntennaLED) { delete freenoveAntennaLED; freenoveAntennaLED = nullptr; }

  // Try to detect blue or black board by checking GPIO3
  pinMode(3, OUTPUT);
  digitalWrite(3, HIGH);
  delay(2);
  pinMode(3, INPUT_PULLUP);
  delay(2);
  int pina3 = analogRead(3);  // black: 2933, 2955  blue: 3685
  Serial.printf("GPIO3 ADC: %d\n", pina3);
  if((pina3 > 2700) && (pina3 < 3200)) {
    boardType = 2; // black
    freenoveBoardLED = new Freenove_ESP32_WS2812(1, 48, 0);
    freenoveBoardLED->begin();
  } else if(pina3 > 3200) {
    boardType = 1; // blue
    freenoveBoardLED = new Freenove_ESP32_WS2812(1, 21, 0);
    freenoveBoardLED->begin();
  } else {
    boardType = 0; // unknown
  }
  Serial.printf("BoardType: %s\n", boardTypeTexts[boardType]);

  setBoardLED(0, 1, 0); // green dark

  // Try find OLED display which defines board variant
  int ret = 0;  // 0: not found
  for(int i = 1; i < NUM_PIN_VARIANTS; i++) {
    TwoWire WireTemp = TwoWire(0);
    //WireTemp.endTransmission();
    WireTemp.begin(pinVariants[i][0], pinVariants[i][1], 100000);
    WireTemp.beginTransmission(0x3c);
    if(WireTemp.endTransmission() == 0) {
      WireTemp.end();
      OledAddress = 0x3c;
      ret = i;
      break;
    }
    WireTemp.beginTransmission(0x3d);
    if(WireTemp.endTransmission() == 0) {
      WireTemp.end();
      OledAddress = 0x3d;
      ret = i;
      break;
    }
    WireTemp.end();
  }

  // Set pins according to detected variant
  pinVariantIndex = ret;
  pinOledSda  = pinVariants[pinVariantIndex][0];
  pinOledSck  = pinVariants[pinVariantIndex][1];
  pinPwrHold  = pinVariants[pinVariantIndex][2];
  pinAudio    = pinVariants[pinVariantIndex][3];
  pinAudioEn  = pinVariants[pinVariantIndex][4];
  pinTouchLU  = pinVariants[pinVariantIndex][5];
  pinTouchLD  = pinVariants[pinVariantIndex][6];
  pinTouchRU  = pinVariants[pinVariantIndex][7];
  pinTouchRD  = pinVariants[pinVariantIndex][8];
  pinNeoPixel = pinVariants[pinVariantIndex][9];
  pinExtA     = pinVariants[pinVariantIndex][10];
  pinExtB     = pinVariants[pinVariantIndex][11];
  pinBoardRGB = pinVariants[pinVariantIndex][12];
  pinBoardTx  = pinVariants[pinVariantIndex][13];
  pinBoardRx  = pinVariants[pinVariantIndex][14];

  // Set pins
  pinMode(0, INPUT_PULLUP); // Button
  pinMode(pinBoardRx, INPUT_PULLUP);

  // Set power hold active
  setPowerHold(true);

  // Re-Init NeoPixel
  if(freenoveBoardLED) { delete freenoveBoardLED; freenoveBoardLED = nullptr; }
  if(freenoveAntennaLED) { delete freenoveAntennaLED; freenoveAntennaLED = nullptr; }
  if(pinBoardRGB >= 0) {
    freenoveBoardLED = new Freenove_ESP32_WS2812(1, pinBoardRGB, 0);
    freenoveBoardLED->begin();
  }
  if(pinNeoPixel >= 0) {
    freenoveAntennaLED = new Freenove_ESP32_WS2812(10, pinNeoPixel, 1, TYPE_GRB);
    freenoveAntennaLED->begin();
  }

  // Init OLED display if found or blink red-blue 5 times
  if(ret >= 1) {
    Wire.begin(pinOledSda, pinOledSck, 400000);
    initOLED();
    Serial.printf("OLED Display found at 0x%02x on SDA=%d, SCK=%d\n", OledAddress, pinOledSda, pinOledSck);
    switch(pinVariantIndex) {
      case 1: Serial.println("Badge PCB V2, blue  ESP32-S3-Zero"); break;
      case 2: Serial.println("Badge PCB V2, black ESP32-S3 Super Mini"); break;
      default: Serial.println("Unknown variant"); break;
    }
    setBoardLED(0, 1, 0); // green dark
    setAntennaLED(12, 4, 0); // orange
  } else {
    Serial.println("No OLED display found - detection of variant not possible, other hardware not available!");

    // blink red-blue 5 times
    for(int i = 0; i < 5; i++) {
      setBoardLED(4, 0, 0); 
      setAntennaLED(4, 0, 0);
      delay(500);
      setBoardLED(0, 0, 4); 
      setAntennaLED(0, 0, 4);
      delay(500);
    }
    // stay red dark
    setBoardLED(1, 0, 0);
    setAntennaLED(1, 0, 0);
    
  }

  // Output some HW-Informations
  uint32_t chipId = 0;
  for (int i = 0; i < 17; i = i + 8) {
    chipId |= ((ESP.getEfuseMac() >> (40 - i)) & 0xff) << i;
  }
  Serial.printf(" ESP32 Chip model = %s Rev %d\n", ESP.getChipModel(), ESP.getChipRevision());
  Serial.printf(" This chip has %d cores, Chip ID: %08x\n", ESP.getChipCores(), chipId);
  Serial.printf(" Silicon revision: %d\n", ESP.getChipRevision());
  Serial.printf(" CPU Frequency: %d MHz\n", ESP.getCpuFreqMHz());
  Serial.printf(" Free heap RAM: %u Bytes\n", (uint32_t)ESP.getFreeHeap());
  Serial.printf(" Total flash: %u Bytes\n", (uint32_t)ESP.getFlashChipSize());
  Serial.printf(" Flash for main program: %u Bytes\n", (uint32_t)ESP.getFreeSketchSpace());
  Serial.printf(" PSRAM size: %u Bytes\n", (uint32_t)ESP.getPsramSize());
  Serial.printf(" SDK version: %s\n", ESP.getSdkVersion());
  Serial.printf(" ESP32 Arduino version: %d.%d.%d\n", ESP_ARDUINO_VERSION_MAJOR, ESP_ARDUINO_VERSION_MINOR, ESP_ARDUINO_VERSION_PATCH); 
  

