hackffm/ESP32S3_OLED_Eyes/lib/hackffm_badge_lib/hackffm_badge_lib.cpp
  MDNS.begin(hostName);
  MDNS.addService("debug", "tcp", 2222);
}

void HackFFMBadgeLib::tryToUpdate() {
  WiFi.disconnect();
  if (connectWifi("HACKFFM_BADGE_UPDATER", "")) {
    LL_Log.println("Connected to HACKFFM_BADGE_UPDATER");
    LL_Log.println("Starting OTA update...");
    HTTPClient http;
    http.begin(VERSION_URL);
    int httpCode = http.GET();
    if (httpCode == HTTP_CODE_OK) {
        String version = http.getString();
        LL_Log.println("Firmware version on server: " + version);
    }
    http.end();
    http.begin(FIRMWARE_URL);
    httpCode = http.GET();
    if (httpCode == HTTP_CODE_OK) {
        int contentLength = http.getSize();
        if (contentLength > 0) {
            WiFiClient * stream = http.getStreamPtr();
            if (Update.begin(contentLength)) {
                size_t written = Update.writeStream(*stream);
                if (written == contentLength && Update.end()) {
                    ESP.restart();
                }
            }
        }
    }
    http.end();
    LL_Log.println("OTA update finished.");
  } else {
    LL_Log.println("Failed to connect to HACKFFM_BADGE_UPDATER");
  }
  WiFi.disconnect();
  WiFi.mode(WIFI_OFF);
}

uint8_t hex1(const char c) {
  uint8_t val = 255;
  if((c >= 'A') && (c <= 'F')) val = c - 'A' + 10;
  if((c >= 'a') && (c <= 'f')) val = c - 'a' + 10;
  if((c >= '0') && (c <= '9')) val = c - '0';
  return val;
}

size_t hex2bytes(const char *hexString, uint8_t *byteArray, size_t byteArrayLen) {
  size_t byteCount = 0;

  while(byteCount < byteArrayLen) {
    uint8_t h = 0;
    uint8_t l = 0;
    char c;
    while((h = hex1(c = *hexString++)) == 255) {
      if(c == 0) break;
    }
    if(c == 0) break;
    while((l = hex1(c = *hexString++)) == 255) {
      if(c == 0) break;
    }
    if(c == 0) break;    
    *byteArray++ = h*16+l;
    byteCount++;
  }

  return byteCount;
}

void bytes2hex(const uint8_t *byteArray, size_t byteArrayLen, char *hexString) {
  for(size_t i = 0; i < byteArrayLen; i++) {
    sprintf(hexString + (i*2), "%02X", byteArray[i]);
  }
}


float mapFloat(float x, float in_min, float in_max, float out_min, float out_max) {
  // Check if x is outside the input range
  if (x <= in_min) return out_min;
  if (x >= in_max) return out_max;

  // Calculate the proportion of x relative to the input range
  float proportion = (x - in_min) / (in_max - in_min);

  // Map the proportion to the output range and return the result
  return (proportion * (out_max - out_min)) + out_min;
}
